In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame([{'Name': 'Chris', 'Item Purchased': 'Sponge', 'Cost': 22.50},
                   {'Name': 'Kevyn', 'Item Purchased': 'Kitty Litter', 'Cost': 2.50},
                   {'Name': 'Filip', 'Item Purchased': 'Spoon', 'Cost': 5.00}],
                  index=['Store 1', 'Store 1', 'Store 2'])
df

          Name Item Purchased  Cost
Store 1  Chris         Sponge  22.5
Store 1  Kevyn   Kitty Litter   2.5
Store 2  Filip          Spoon   5.0

In [3]:
df['date'] = ['December 1','December 2','December 3']

In [4]:
df

          Name Item Purchased  Cost        date
Store 1  Chris         Sponge  22.5  December 1
Store 1  Kevyn   Kitty Litter   2.5  December 2
Store 2  Filip          Spoon   5.0  December 3

In [5]:
df['Delivered'] = True

In [6]:
df

          Name Item Purchased  Cost        date  Delivered
Store 1  Chris         Sponge  22.5  December 1       True
Store 1  Kevyn   Kitty Litter   2.5  December 2       True
Store 2  Filip          Spoon   5.0  December 3       True

In [7]:
adf = df.reset_index()

In [9]:
adf['Date'] = pd.Series({0:'December 1',2:'mid-may'})

In [10]:
adf

     index   Name Item Purchased  Cost        date  Delivered        Date
0  Store 1  Chris         Sponge  22.5  December 1       True  December 1
1  Store 1  Kevyn   Kitty Litter   2.5  December 2       True         NaN
2  Store 2  Filip          Spoon   5.0  December 3       True     mid-may

In [11]:
staff_df = pd.DataFrame([{'Name': 'Kelly', 'Role': 'Director of HR'},
                         {'Name': 'Sally', 'Role': 'Course liasion'},
                         {'Name': 'James', 'Role': 'Grader'}])
student_df = pd.DataFrame([{'Name': 'James', 'School': 'Business'},
                           {'Name': 'Mike', 'School': 'Law'},
                           {'Name': 'Sally', 'School': 'Engineering'}])

In [14]:
staff_df.set_index('Name')
student_df.set_index('Name')

            School
Name
James     Business
Mike           Law
Sally  Engineering

In [15]:
print(staff_df)
print(student_df)

    Name            Role
0  Kelly  Director of HR
1  Sally  Course liasion
2  James          Grader
    Name       School
0  James     Business
1   Mike          Law
2  Sally  Engineering

In [16]:
pd.merge(staff_df,student_df,how='outer',left_index=True,right_index=True)

  Name_x            Role Name_y       School
0  Kelly  Director of HR  James     Business
1  Sally  Course liasion   Mike          Law
2  James          Grader  Sally  Engineering

In [18]:
pd.merge(staff_df,student_df,how='inner',left_index=True,right_index=True)

  Name_x            Role Name_y       School
0  Kelly  Director of HR  James     Business
1  Sally  Course liasion   Mike          Law
2  James          Grader  Sally  Engineering

In [19]:
pd.merge(staff_df,student_df,how='left',left_index=True,right_index=True)

  Name_x            Role Name_y       School
0  Kelly  Director of HR  James     Business
1  Sally  Course liasion   Mike          Law
2  James          Grader  Sally  Engineering

In [20]:
pd.merge(staff_df,student_df,how='right',left_index=True,right_index=True)

  Name_x            Role Name_y       School
0  Kelly  Director of HR  James     Business
1  Sally  Course liasion   Mike          Law
2  James          Grader  Sally  Engineering

In [22]:
staff_df = staff_df.reset_index()
student_df = student_df.reset_index()

In [23]:
pd.merge(staff_df,student_df,how='left',left_on='Name',right_on='Name')

   index_x   Name            Role  index_y       School
0        0  Kelly  Director of HR      NaN          NaN
1        1  Sally  Course liasion      2.0  Engineering
2        2  James          Grader      0.0     Business

In [24]:
staff_df = pd.DataFrame([{'Name': 'Kelly', 'Role': 'Director of HR', 'Location': 'State Street'},
                         {'Name': 'Sally', 'Role': 'Course liasion', 'Location': 'Washington Avenue'},
                         {'Name': 'James', 'Role': 'Grader', 'Location': 'Washington Avenue'}])
student_df = pd.DataFrame([{'Name': 'James', 'School': 'Business', 'Location': '1024 Billiard Avenue'},
                           {'Name': 'Mike', 'School': 'Law', 'Location': 'Fraternity House #22'},
                           {'Name': 'Sally', 'School': 'Engineering', 'Location': '512 Wilson Crescent'}])

In [27]:
pd.merge(staff_df,student_df,how='left',left_on='Name',right_on='Name')

    Name            Role         Location_x       School            Location_y
0  Kelly  Director of HR       State Street          NaN                   NaN
1  Sally  Course liasion  Washington Avenue  Engineering   512 Wilson Crescent
2  James          Grader  Washington Avenue     Business  1024 Billiard Avenue

In [28]:
staff_df = pd.DataFrame([{'First Name': 'Kelly', 'Last Name': 'Desjardins', 'Role': 'Director of HR'},
                         {'First Name': 'Sally', 'Last Name': 'Brooks', 'Role': 'Course liasion'},
                         {'First Name': 'James', 'Last Name': 'Wilde', 'Role': 'Grader'}])
student_df = pd.DataFrame([{'First Name': 'James', 'Last Name': 'Hammond', 'School': 'Business'},
                           {'First Name': 'Mike', 'Last Name': 'Smith', 'School': 'Law'},
                           {'First Name': 'Sally', 'Last Name': 'Brooks', 'School': 'Engineering'}])

In [33]:
pd.merge(staff_df,student_df,how='inner',left_on=['First Name','Last Name'],right_on=['First Name','Last Name'])

  First Name Last Name            Role       School
0      Sally    Brooks  Course liasion  Engineering

  First Name Last Name       School
0      James   Hammond     Business
1       Mike     Smith          Law
2      Sally    Brooks  Engineering